var express = require('express');
var  user = require('../dao/dbConnect');
var router = express.Router();

/* GET home page. */
router.get('/', function(req, res, next) {
  client = user.connect();
  user.selectAll(function(result){
    res.render('index',{items: result});
  })
});
router.get('/first',function(req,res,next){
  res.json({
      "lists":[
          {
              "title": "风儿怜惜着你的面庞",
              "time": "2010/7/18",
              "type":"个人日志",
              "content":"三月，醉一场青春的流年。慢步在三月的春光里，走走停停，看花开嫣然，看春雨绵绵，感受春风拂面，春天，就是青春的流年。青春，是人生中最美的风景。青春，是一场花开的遇见；青春，是一场痛并快乐着的旅行；青春，是一场轰轰烈烈的比赛；青春，是一场鲜衣奴马的争荣岁月；青春，是一场风花雪月的光阴。"
          },{
              "title": "窗边的月光洒落一地",
              "time": "2010/7/20",
              "type":"休闲",
              "content":"青春往事，多么甜蜜；青春岁月，多么靓丽；青春流年，如火如荼。青春里，我们向着梦想前进。跌倒过，伤心过，快乐过，痛苦过，孤独过，彷徨过，迷茫过。总是，在悠悠的岁月中徘徊；总是，在如春的生命中成长；总是，在季节的交替中感悟人生四季的美妙与韵律；总是，在多愁善感中体悟青春的美好与无奈。"
          },{
              "title": "浮动着是生脆的枝桠",
              "time": "2010/7/20",
              "type":"其他",
              "content":"三月的鲜花，一树树，一束束，一簇簇，而青春，就是像三月的鲜花一样美丽迷人，生机盎然，姹紫嫣红，生机勃勃。三月，是青春里最美最温暖的风景。三月的美，就像青春的美，充满活力，充满生机，充满昂扬的斗志。三月的美，就像青春的花季，在那里我们可以感受青春的跳动与感动，感受青春的曼妙与奇妙；感受青春的悸动与心跳。"
          },{
              "title": "倚着窗边的栏杆",
              "time": "2010/7/25",
              "type":"个人日志",
              "content":"青春，如三月的春光，安暖向阳。在美丽的青春年华，我们手牵手，肩并肩，跨过岁月山河，跨过锦瑟流年，跨过天涯海角，在三月的春光里沐浴金色的光泽。三月的春光，让青春的我们看到希望，看到自己有一颗年轻跳动的心，看到蓝天白云，看到明媚的灿烂。三月的春光，温暖无比，就像我们的青春，有着长辈的呵护，有着老师的循循教导，它们就像春光，照耀着我们年轻的心。"
          },{
              "title": "思念着过往",
              "time": "2010/7/25",
              "type":"休闲",
              "content":"青春，如三月的春雨，我们在春雨中得到滋润。春雨，淅淅沥沥，纷纷扬扬，打在青春的雨季，打在我们心里，打在我们的生活里，打在我们的生命中，打在我们的灵魂深处。一场春雨，滋润着我们的青春流年，让我们快乐成长，让我们如沐春雨，让我们感受亲恩。三月的春雨，就像我们的父母，用他们的爱心，滋润着我们幼小不安的心灵。"
          }
      ]
  })
})
module.exports = router;
